VibeCoding-tw/esp32c3-launcher/src/main.cpp
        <div id="joystick" class="mb-6">
            <div id="joystick-inner">
                 <div id="joystick-thumb"></div>
            </div>
        </div>

        <div class="text-center space-y-2 pb-4">
            <p class="text-xl">狀態: <span id="status" class="text-green-400">靜止</span></p>
            <p class="text-xs text-gray-500">
                目標 X: <span id="val_x">0</span> | 目標 Y: <span id="val_y">0</span>
            </p>
            <div class="pt-4">
                <a href="/update_factory" class="text-[10px] text-gray-600 hover:text-indigo-400">韌體維護 (Factory OTA)</a>
            </div>
        </div>
    </div>

    <script>
        const joystickContainer = document.getElementById('joystick'); 
        const joystick = document.getElementById('joystick-inner'); 
        const thumb = document.getElementById('joystick-thumb');
        const statusEl = document.getElementById('status');
        const valXEl = document.getElementById('val_x');
        const valYEl = document.getElementById('val_y');
        const valVEl = document.getElementById('val_v');
        const valRTEl = document.getElementById('val_rt');
        const valRSELEl = document.getElementById('val_rs');
        
        const DEADZONE_PWM = 20; 
        const maxRadius = joystick.clientWidth / 2;
        let isDragging = false;
        let controlInterval;
        let lastMotorT = 0;
        let lastMotorS = 0;
        const baseIp = ''; 
        
        function updateMotorValues(offsetX, offsetY) {
            const distance = Math.sqrt(offsetX * offsetX + offsetY * offsetY);
            const magnitude = Math.min(1.0, distance / maxRadius);
            
            // 使用 Scaled-to-Square 映射，確保在圓形搖桿邊緣的任何角度（包括斜角）都能輸出 255
            let rawX = offsetX / maxRadius;
            let rawY = offsetY / maxRadius;
            
            let maxAxial = Math.max(Math.abs(rawX), Math.abs(rawY));
            if (maxAxial > 0) {
                let scale = magnitude / maxAxial;
                rawX *= scale;
                rawY *= scale;
            }

            let speedS = Math.round(rawX * 255);
            let speedT = Math.round(rawY * 255);

            if (Math.abs(speedT) < DEADZONE_PWM) speedT = 0;
            if (Math.abs(speedS) < DEADZONE_PWM) speedS = 0;

            valYEl.textContent = speedT;
            valXEl.textContent = speedS;
            
            let currentStatus = "靜止";
            let statusColor = "text-green-400";
            if (Math.abs(speedT) > 0 || Math.abs(speedS) > 0) {
                 statusColor = "text-yellow-400";
                 if (speedT > 50 && Math.abs(speedS) < 50) currentStatus = "前進中";
                 else if (speedT < -50 && Math.abs(speedS) < 50) currentStatus = "後退中";
                 else if (speedS > 50) currentStatus = "右轉中";
                 else if (speedS < -50) currentStatus = "左轉中";
                 else currentStatus = "移動中";
            }
            statusEl.textContent = currentStatus;
            statusEl.className = "text-sm font-bold " + statusColor;

            // 僅更新快取，實際發送由 setInterval 負責
            lastMotorT = speedT;
            lastMotorS = speedS;
        }

        // Config Elements Dashboard
        const cfgLT = document.getElementById('cfg_lt');
        const cfgST = document.getElementById('cfg_st');
        const cfgKT = document.getElementById('cfg_kt');
        const cfgLS = document.getElementById('cfg_ls');
        const cfgSS = document.getElementById('cfg_ss');
        const cfgKS = document.getElementById('cfg_ks');

        function fetchConfig() {
            fetch('/config')
                .then(r => r.json())
                .then(data => {
                    if(cfgLT) cfgLT.textContent = data.pwmEffectiveLimitT;
                    if(cfgST) cfgST.textContent = data.rampAccelStepT;
                    if(cfgKT) cfgKT.textContent = data.pwmStartKickT;
                    if(cfgLS) cfgLS.textContent = data.pwmEffectiveLimitS;
                    if(cfgSS) cfgSS.textContent = data.rampAccelStepS;
                    if(cfgKS) cfgKS.textContent = data.pwmStartKickS;
                })
                .catch(e => console.error('Config fetch failed', e));
        }
        fetchConfig();

        function sendControl(T, S) {
            fetch(`${baseIp}/control?t=${T}&s=${S}`)
                .then(response => response.json())
                .then(data => {
                    // 更新電壓與即時 Ramp 數值
                    if (data.v !== undefined) {
                        valVEl.textContent = data.v.toFixed(2);
                        // 低電壓警示 (假設 1S 鋰電池 3.4V)
                        if (data.v < 3.4) valVEl.className = "text-red-500";
                        else if (data.v < 3.6) valVEl.className = "text-yellow-400";
                        else valVEl.className = "text-green-400";
                    }
                    if (data.rt !== undefined) valRTEl.textContent = data.rt;
                    if (data.rs !== undefined) valRSELEl.textContent = data.rs;
                })
                .catch(err => console.error('Fetch error:', err));
        }

        function resetThumbPosition() {
            thumb.style.left = '50%';
            thumb.style.top = '50%';
            thumb.style.transform = 'translate(-50%, -50%)';
            thumb.classList.remove('active');
        }

        function stopMotors() {
            isDragging = false;
            if (controlInterval) clearInterval(controlInterval);
            resetThumbPosition();
            
            // 歸零快取並發送最後一次停止命令
            lastMotorT = 0;
            lastMotorS = 0;
            updateMotorValues(0, 0); 
            sendControl(0, 0);
        }

        function handleMove(e) {
            e.preventDefault();
            if (!isDragging) return;

            // 取得觸摸或滑鼠位置
            const clientX = e.touches ? e.touches[0].clientX : e.clientX;
            const clientY = e.touches ? e.touches[0].clientY : e.clientY;

            // 取得搖桿容器 (joystick-inner) 的位置
            const rect = joystick.getBoundingClientRect();
            const centerX = rect.left + maxRadius;
            const centerY = rect.top + maxRadius;

            // 1. 原始位移 (CSS 座標: X 向右為正, Y 向下為正)
            let offsetX = clientX - centerX;
            let offsetY = clientY - centerY; 
            
            // 2. 限制位移在搖桿圓盤內
            const distance = Math.sqrt(offsetX * offsetX + offsetY * offsetY);
            if (distance > maxRadius) {
                const angle = Math.atan2(offsetY, offsetX);
                offsetX = maxRadius * Math.cos(angle);
                offsetY = maxRadius * Math.sin(angle);
            }
            
            // 3. 更新搖桿中心點位置 (使用 CSS 座標)
            const thumbX = maxRadius + offsetX;
            const thumbY = maxRadius + offsetY; 

