VibeCoding-tw/esp32c3-launcher/src/main.cpp
            thumb.style.left = `${thumbX}px`;
            thumb.style.top = `${thumbY}px`;
            thumb.style.transform = 'translate(-50%, -50%)';

            // 4. 更新馬達值 (使用 Cartesian 座標: Y 軸向上為正)
            // 將 CSS Y 軸反轉: -offsetY
            updateMotorValues(offsetX, -offsetY);
        }

        function handleStart(e) {
            isDragging = true;
            thumb.classList.add('active');
            handleMove(e); // 立即更新一次位置和值

            // 使用定時器發送控制命令 (20Hz / 每 50ms 一次)
            // 這樣可以平衡「即時性」與「網路負擔」，避免因請求過快導致 ESP32 當機
            if (controlInterval) clearInterval(controlInterval);
            controlInterval = setInterval(() => {
                sendControl(lastMotorT, lastMotorS);
            }, 50); 
        }

        function handleEnd() {
            stopMotors();
        }

        // --- 事件監聽 ---
        joystick.addEventListener('mousedown', handleStart);
        document.addEventListener('mousemove', handleMove);
        document.addEventListener('mouseup', handleEnd);

        joystick.addEventListener('touchstart', handleStart);
        document.addEventListener('touchmove', handleMove);
        joystickContainer.addEventListener('touchend', handleEnd); 

        // 初始化時發送一次停止命令
        stopMotors(); 
    </script>
</body>
</html>)rawliteral";

const char UPDATE_PAGE_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Updating Vibe Racer...</title>
    <script src="https://cdn.tailwindcss.com"></script>
    <style>
        body { background: #0f172a; color: #f9fafb; font-family: system-ui; display: flex; justify-content: center; align-items: center; min-height: 100vh; margin: 0; }
        .glass { background: rgba(30, 41, 59, 0.7); backdrop-filter: blur(12px); border: 1px solid rgba(255,255,255,0.1); border-radius: 24px; }
        .spinner { border: 4px solid rgba(255, 255, 255, 0.1); border-left-color: #6366f1; border-radius: 50%; width: 40px; height: 40px; animation: spin 1s linear infinite; }
        @keyframes spin { to { transform: rotate(360deg); } }
    </style>
</head>
<body class="p-4 text-center">
    <div class="glass p-8 max-w-sm w-full shadow-2xl">
        <div class="flex justify-center mb-6">
            <div class="spinner"></div>
        </div>
        <h1 class="text-2xl font-bold text-indigo-400 mb-2">系統更新中...</h1>
        <p class="text-gray-400 text-sm mb-6">正在從 GitHub 獲取最新韌體，請勿關閉電源。</p>
        
        <div class="space-y-3 text-left text-xs text-gray-500 mb-8">
            <div class="flex items-center space-x-2"><span class="w-2 h-2 bg-green-500 rounded-full"></span> <span>連線至 GitHub...</span></div>
            <div class="flex items-center space-x-2"><span class="w-2 h-2 bg-indigo-500 rounded-full animate-pulse"></span> <span>下載並寫入 Flash...</span></div>
            <div class="flex items-center space-x-2"><span class="w-2 h-2 bg-gray-600 rounded-full"></span> <span>重新啟動裝置...</span></div>
        </div>

        <p id="countdown" class="text-indigo-300/60 text-xs">預計於 40 秒後自動跳轉</p>
    </div>

    <script>
        let timeLeft = 40;
        const countdownEl = document.getElementById('countdown');
        const timer = setInterval(() => {
            timeLeft--;
            countdownEl.textContent = `預計於 ${timeLeft} 秒後自動跳轉`;
            if (timeLeft <= 0) {
                clearInterval(timer);
                location.href = '/';
            }
        }, 1000);

        // 30 秒後開始嘗試連線小車，一旦成功就跳轉
        setTimeout(() => {
            setInterval(() => {
                fetch('/').then(r => { if(r.ok) location.href = '/'; }).catch(e => {});
            }, 3000);
        }, 30000);
    </script>
</body>
</html>)rawliteral";
const char MAINTENANCE_PAGE_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Vibe Racer Maintenance</title>
    <script src="https://cdn.tailwindcss.com"></script>
    <style>
        body { background: #0f172a; color: #f9fafb; font-family: system-ui; display: flex; justify-content: center; align-items: center; min-height: 100vh; margin: 0; padding: 1rem;}
        .glass { background: rgba(30, 41, 59, 0.7); backdrop-filter: blur(12px); border: 1px solid rgba(255,255,255,0.1); border-radius: 24px; width: 100%; max-width: 450px; overflow: hidden; }
        .section { border-bottom: 1px solid rgba(255,255,255,0.05); padding: 1.5rem; }
        .btn { transition: all 0.2s; cursor: pointer; border-radius: 12px; font-weight: bold; }
        .btn:hover { transform: translateY(-1px); }
        input[type="file"]::file-selector-button { background: #374151; color: white; padding: 0.5rem 1rem; border: none; border-radius: 8px; margin-right: 1rem; cursor: pointer; }
    </style>
</head>
<body>
    <div class="glass shadow-2xl">
        <div class="bg-indigo-600/20 p-6 border-b border-indigo-500/30">
            <h1 class="text-2xl font-bold text-indigo-300">維修與更新</h1>
            <p class="text-xs text-gray-400 mt-1">裝置 ID: %HOSTNAME% | 版本: <span class="text-indigo-400 font-mono">%VERSION%</span></p>
        </div>

        <!-- 系統設定區 -->
        <div class="section">
            <h2 class="text-sm font-bold text-gray-400 uppercase tracking-widest mb-4">系統設定</h2>
            <div class="flex items-center justify-between p-4 bg-white/5 rounded-2xl border border-white/5">
                <div>
                    <h3 class="font-bold text-gray-200">開機自動更新</h3>
                    <p class="text-xs text-gray-500">開機連網後自動檢查 GitHub 版本</p>
                </div>
                <button onclick="location.href='/toggle_auto_update'" class="relative inline-flex items-center h-6 rounded-full w-11 transition-colors focus:outline-none %TOGGLE_BG_COLOR%">
                    <span class="inline-block w-4 h-4 transform bg-white rounded-full transition-transform %TOGGLE_DOT_POS%"></span>
                </button>
            </div>
        </div>

