VibeCoding-tw/esp32c3-launcher/src/main.cpp
        <!-- GitHub 更新區 -->
        <div class="section bg-indigo-500/5">
            <h2 class="text-sm font-bold text-gray-400 uppercase tracking-widest mb-4">雲端更新 (GitHub)</h2>
            <div class="p-4 rounded-2xl border border-indigo-500/20">
                <p class="text-xs text-gray-500 mb-4">自動抓取 <code>latest/firmware.bin</code> 並更新至 Factory 分區。</p>
                <button onclick="if(confirm('確認要從 GitHub 下載最新韌體？')) location.href='/update_github';" 
                    class="w-full btn bg-indigo-600 hover:bg-indigo-500 text-white p-3 shadow-lg flex items-center justify-center space-x-2">
                    <span>🚀 啟動 GitHub 雲端更新</span>
                </button>
            </div>
        </div>

        <!-- 本地上傳區 -->
        <div class="section">
            <h2 class="text-sm font-bold text-gray-400 uppercase tracking-widest mb-4">本地上傳 (Manual)</h2>
            <form method="POST" action="/update_factory" enctype="multipart/form-data" class="space-y-4">
                <div class="p-4 bg-gray-900/40 rounded-2xl border border-white/5">
                    <input type="file" name="update" class="text-xs text-gray-400 w-full">
                </div>
                <button type="submit" class="w-full btn bg-gray-700 hover:bg-gray-600 text-gray-300 p-3">
                    傳送並更新 Factory 分區
                </button>
            </form>
        </div>

        <div class="p-4 text-center">
            <a href="/" class="text-xs text-gray-500 hover:text-indigo-400 transition">← 返回控制主頁</a>
        </div>
    </div>
</body>
</html>)rawliteral";

// --- 自定義 Factory OTA 更新處理 ---
void handleFactoryUpdate() {
    String html = MAINTENANCE_PAGE_HTML;
    html.replace("%HOSTNAME%", globalHostname);
    html.replace("%VERSION%", CURRENT_VERSION);
    
    // 處理 Toggle 狀態
    if (motorConfig.autoUpdateEnabled == 1) {
        html.replace("%TOGGLE_BG_COLOR%", "bg-indigo-600");
        html.replace("%TOGGLE_DOT_POS%", "translate-x-6");
    } else {
        html.replace("%TOGGLE_BG_COLOR%", "bg-gray-700");
        html.replace("%TOGGLE_DOT_POS%", "translate-x-1");
    }

    server.send(200, "text/html", html);
}

void handleToggleAutoUpdate() {
    motorConfig.autoUpdateEnabled = (motorConfig.autoUpdateEnabled == 1) ? 0 : 1;
    saveMotorConfig();
    // 重新跳轉回維修頁面
    server.sendHeader("Location", "/update_factory");
    server.send(303);
}

void handleFactoryUpdateUpload() {
    HTTPUpload& upload = server.upload();
    static bool ota_started = false;
    static const esp_partition_t* factory_partition = NULL;
    static esp_ota_handle_t update_handle = 0;

    if (upload.status == UPLOAD_FILE_START) {
        Serial.printf("Factory OTA Start: %s\n", upload.filename.c_str());
        factory_partition = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_FACTORY, NULL);
        if (factory_partition == NULL) {
            Serial.println("❌ 找不到 Factory 分區!");
            return;
        }
        esp_err_t err = esp_ota_begin(factory_partition, OTA_SIZE_UNKNOWN, &update_handle);
        if (err != ESP_OK) {
            Serial.printf("❌ esp_ota_begin 失敗: %s\n", esp_err_to_name(err));
            return;
        }
        ota_started = true;
    } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (ota_started) {
            esp_err_t err = esp_ota_write(update_handle, upload.buf, upload.currentSize);
            if (err != ESP_OK) {
                Serial.printf("❌ esp_ota_write 失敗: %s\n", esp_err_to_name(err));
                ota_started = false;
            }
        }
    } else if (upload.status == UPLOAD_FILE_END) {
        if (ota_started) {
            esp_err_t err = esp_ota_end(update_handle);
            if (err != ESP_OK) {
                Serial.printf("❌ esp_ota_end 失敗: %s\n", esp_err_to_name(err));
            } else {
                err = esp_ota_set_boot_partition(factory_partition);
                if (err != ESP_OK) {
                    Serial.printf("❌ 設定啟動分區失敗: %s\n", esp_err_to_name(err));
                } else {
                    Serial.println("✅ Factory OTA 更新成功! 正在重啟...");
                    server.send(200, "text/plain", "SUCCESS. Rebooting...");
                    delay(500);
                    ESP.restart();
                }
            }
        }
        ota_started = false;
    }
}

// --- GitHub 雲端 OTA 更新邏輯 ---
void performGitHubCloudUpdate() {
    String url = "https://github.com/VibeCoding-tw/esp32c3-launcher/releases/latest/download/firmware.bin";
    Serial.println("--- 啟動 GitHub 雲端更新 ---");
    Serial.print("Target: "); Serial.println(url);

    WiFiClientSecure client;
    client.setInsecure(); // 在此場景下跳過證書驗證以提高相容性

    HTTPClient http;
    http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS); // 必須追蹤 GitHub 的 302 重定向
    
    if (http.begin(client, url)) {
        int httpCode = http.GET();
        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
            int contentLength = http.getSize();
            if (contentLength <= 0) {
                Serial.println("❌ 無法取得檔案大小");
                http.end();
                return;
            }

            // 取得 Factory 分區
            const esp_partition_t* factory_partition = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_FACTORY, NULL);
            if (factory_partition == NULL) {
                Serial.println("❌ 找不到 Factory 分區!");
                http.end();
                return;
            }

            esp_ota_handle_t update_handle = 0;
            esp_err_t err = esp_ota_begin(factory_partition, OTA_SIZE_UNKNOWN, &update_handle);
            if (err != ESP_OK) {
                Serial.printf("❌ esp_ota_begin 失敗: %s\n", esp_err_to_name(err));
                http.end();
                return;
            }

            WiFiClient* stream = http.getStreamPtr();
            size_t written = 0;
            uint8_t buff[1024];
            
            while (http.connected() && (written < contentLength)) {
                size_t size = stream->available();
                if (size) {
                    int c = stream->readBytes(buff, ((size > sizeof(buff)) ? sizeof(buff) : size));
                    esp_ota_write(update_handle, buff, c);
                    written += c;
                    if (written % 10240 == 0) Serial.printf("Progress: %u%%\r", (written * 100) / contentLength);
                }
                delay(1);
            }

            if (written == contentLength) {
                err = esp_ota_end(update_handle);
                if (err == ESP_OK) {
                    err = esp_ota_set_boot_partition(factory_partition);
                    if (err == ESP_OK) {
                        Serial.println("\n✅ GitHub 雲端更新成功! 正在重啟...");
                        delay(500);
                        ESP.restart();
                    }
                }
            } else {
                Serial.println("\n❌ 下載不完整");
            }
        } else {
            Serial.printf("❌ HTTP GET 失敗, code: %d\n", httpCode);
        }
        http.end();
    } else {
        Serial.println("❌ 無法連線至 GitHub");
    }
}

