VibeCoding-tw/esp32c3-launcher/src/main.cpp
void handleGitHubUpdate() {
    server.send(200, "text/html", UPDATE_PAGE_HTML);
    // 延遲一下讓 Web Response 噴出去再開始
    delay(1000);
    performGitHubCloudUpdate();
}

// 檢查遠端版本並決定是否更新
void checkAndPerformAutoUpdate() {
    if (motorConfig.autoUpdateEnabled != 1) {
        Serial.println("[AutoUpdate] 功能已關閉，跳過檢查。");
        return;
    }

    Serial.println("[AutoUpdate] 正在檢查 GitHub 上的最新版本...");
    String versionUrl = "https://github.com/VibeCoding-tw/esp32c3-launcher/releases/latest/download/version.txt";
    
    WiFiClientSecure client;
    client.setInsecure();
    HTTPClient http;
    http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);

    if (http.begin(client, versionUrl)) {
        int httpCode = http.GET();
        if (httpCode == HTTP_CODE_OK) {
            String remoteVersion = http.getString();
            remoteVersion.trim();
            Serial.printf("[AutoUpdate] 本地版本: %s, 遠端版本: %s\n", CURRENT_VERSION, remoteVersion.c_str());
            
            if (remoteVersion != CURRENT_VERSION && remoteVersion.length() > 0) {
                Serial.println("[AutoUpdate] 偵測到新版本! 準備開始自動更新...");
                performGitHubCloudUpdate();
            } else {
                Serial.println("[AutoUpdate] 目前已是最新版本。");
            }
        } else {
            Serial.printf("[AutoUpdate] 無法取得版本資訊, code: %d\n", httpCode);
        }
        http.end();
    }
}

// --- 產生 Hostname ---
void generateHostname() {    
    globalHostname = "esp32c3-" + WiFi.macAddress(); 
    globalHostname.replace(":", ""); 
    globalHostname.toLowerCase(); 
    Serial.printf("Generated Hostname: %s\n", globalHostname.c_str());
}

// 設定預設值與從 NVS 載入參數
void loadMotorConfig() {
    // 預設值 (如果 NVS 中沒有)
    MotorConfig_t defaultConfig = {
        .controlTimeoutT = 500, 
        .controlTimeoutS = 2000, 
        .pwmEffectiveLimitT = 200, 
        .rampAccelStepT = 3, 
        .pwmStartKickT = 60, 
        .pwmEffectiveLimitS = 255, 
        .rampAccelStepS = 20, // 提升轉向步長至 20
        .pwmStartKickS = 120,
        .autoUpdateEnabled = 0, // 預設關閉自動更新以策安全
        .padding = 0
    };

    preferences.begin("motor-config", true);
    size_t size = preferences.getBytes("config", &motorConfig, sizeof(MotorConfig_t));
    preferences.end();

    if (size != sizeof(MotorConfig_t)) {
        motorConfig = defaultConfig; // 載入預設值
        Serial.println("❌ NVS 無馬達參數，使用預設值。");
    } else {
        Serial.println("✅ 從 NVS 載入馬達參數成功。");
    }
    
    // 輸出當前配置
    Serial.printf("  Timeout T: %u ms, S: %u ms\n", motorConfig.controlTimeoutT, motorConfig.controlTimeoutS);
    Serial.printf("  T Limit: %d, T Step: %d, T Kick: %d\n", motorConfig.pwmEffectiveLimitT, motorConfig.rampAccelStepT, motorConfig.pwmStartKickT);
    Serial.printf("  S Limit: %d, S Step: %d, S Kick: %d\n", motorConfig.pwmEffectiveLimitS, motorConfig.rampAccelStepS, motorConfig.pwmStartKickS);
    Serial.printf("  Auto Update: %s\n", motorConfig.autoUpdateEnabled ? "Enabled" : "Disabled");
}

// 將當前參數儲存到 NVS
void saveMotorConfig() {
    preferences.begin("motor-config", false);
    preferences.putBytes("config", &motorConfig, sizeof(MotorConfig_t));
    preferences.end();
    Serial.println("✅ 馬達參數已儲存到 NVS。");
}

// --- 電壓採樣與濾波 ---
void updateBatteryVoltage() {
    if (millis() - lastBatteryCheck < BATT_CHECK_INTERVAL) return;
    lastBatteryCheck = millis();

    int rawAdc = analogRead(BATT_ADC_PIN);
    // 將 ADC 轉換為電壓 ( C3 的 ADC 範圍約 0-3.3V, 12-bit )
    float sensedVolt = (rawAdc / 4095.0) * ADC_VOLT_REF * DIVIDER_RATIO;

    // 指數移動平均濾波 ( Expo Smoothing )
    if (batteryVoltage < 0.1) batteryVoltage = sensedVolt; // 第一次讀取初始化
    else batteryVoltage = (batteryVoltage * 0.9) + (sensedVolt * 0.1);
}

// --- 修正後的 PWM 寫入 (增加 H 橋安全) ---
void setMotorPwm(int speedT, int speedS) {
    // T 馬達防直通處理
    if (speedT > 0) { 
        ledcWrite(LEDC_CH_A2, 0); // 確保另一端先關閉
        ledcWrite(LEDC_CH_A1, speedT);
    } else if (speedT < 0) { 
        ledcWrite(LEDC_CH_A1, 0);
        ledcWrite(LEDC_CH_A2, -speedT); 
    } else { 
        ledcWrite(LEDC_CH_A1, 0); ledcWrite(LEDC_CH_A2, 0);
    }

    // S 馬達防直通處理
    if (speedS > 0) { 
        ledcWrite(LEDC_CH_B1, 0);
        ledcWrite(LEDC_CH_B2, speedS);
    } else if (speedS < 0) { 
        ledcWrite(LEDC_CH_B2, 0);
        ledcWrite(LEDC_CH_B1, -speedS); 
    } else { 
        ledcWrite(LEDC_CH_B1, 0); ledcWrite(LEDC_CH_B2, 0);
    }
}

// --- 修正後的馬達 Ramping 任務 ---
// 額外定義一個變數追蹤 S 馬達持續輸出的時間
unsigned long sMotorStartTime = 0;
const unsigned long S_MOTOR_MAX_ON_TIME = 3000; // 延長至 3 秒，讓使用者能持續維持大幅度轉向

void motorRampTask() {
    if (millis() - lastRampTime < RAMP_INTERVAL_MS) return;
    lastRampTime = millis();
    
    // --- 1. 速度馬達 (T Motor) 邏輯 ---
    if (targetSpeedT == 0) {
        // 速度馬達通常允許慣性滑行或較快減速
        currentSpeedT = 0; 
    } else {
        if (currentSpeedT == 0) {
            // 優化：Kickstart 最小也必須等於目標，或取 Kickstart 值但不得過衝
            int kick = (targetSpeedT > 0) ? motorConfig.pwmStartKickT : -motorConfig.pwmStartKickT;
            if (abs(kick) > abs(targetSpeedT)) currentSpeedT = targetSpeedT;
            else currentSpeedT = kick;
        }
        
        int diffT = targetSpeedT - currentSpeedT;
        if (abs(diffT) <= motorConfig.rampAccelStepT) {
            currentSpeedT = targetSpeedT;
        } else {
            currentSpeedT += (diffT > 0) ? motorConfig.rampAccelStepT : -motorConfig.rampAccelStepT;
        }
    }

    // --- 2. 轉向馬達 (S Motor) 邏輯優化 ---
    if (targetSpeedS == 0) {
        currentSpeedS = 0;
        sMotorStartTime = 0; // 重置計時器
    } else {
        // 紀錄開始轉向的時間點，用以實作「超時降壓」保護邏輯
        if (sMotorStartTime == 0) sMotorStartTime = millis();

        // 啟動 Kickstart
        if (currentSpeedS == 0) {
            // 優化：Kickstart 不應超過目標速度，減少小角度轉向時的抖動
            int kick = (targetSpeedS > 0) ? motorConfig.pwmStartKickS : -motorConfig.pwmStartKickS;
            if (abs(kick) > abs(targetSpeedS)) currentSpeedS = targetSpeedS;
            else currentSpeedS = kick;
        }

        // 轉向 Ramping: 對於兩線式馬達，轉向通常需要比速度更快的響應
        int diffS = targetSpeedS - currentSpeedS;
        if (abs(diffS) <= motorConfig.rampAccelStepS) {
            currentSpeedS = targetSpeedS;
        } else {
            currentSpeedS += (diffS > 0) ? motorConfig.rampAccelStepS : -motorConfig.rampAccelStepS;
        }

        // 【安全保護】如果轉向馬達輸出時間過長，可能是打死了，強制降低輸出以防燒毀
        if (millis() - sMotorStartTime > S_MOTOR_MAX_ON_TIME) {
            // 將輸出限制在 230 (維持強勁扭矩對抗彈簧，但避免長期滿載)
            currentSpeedS = constrain(currentSpeedS, -230, 230); 
        }
    }

    // 最終約束
    currentSpeedT = constrain(currentSpeedT, -motorConfig.pwmEffectiveLimitT, motorConfig.pwmEffectiveLimitT);
    currentSpeedS = constrain(currentSpeedS, -motorConfig.pwmEffectiveLimitS, motorConfig.pwmEffectiveLimitS);
    
