VibeCoding-tw/esp32c3-launcher/src/main.cpp
    setMotorPwm(currentSpeedT, currentSpeedS); 

    // 僅在有動作時輸出 Serial
    static int pLastT, pLastS;
    if (currentSpeedT != pLastT || currentSpeedS != pLastS) {
        if (currentSpeedT != 0 || currentSpeedS != 0) {
            Serial.printf("[Ramp] T:%d | S:%d\n", currentSpeedT, currentSpeedS);
        }
        pLastT = currentSpeedT; pLastS = currentSpeedS;
    }
}

// --- Web Server 處理函式 ---
void handleRoot() {
    String html = HTML_CONTENT; 
    String ipAddress = WiFi.localIP().toString();
    html.replace("%HOSTNAME%", globalHostname);
    html.replace("%IPADDRESS%", ipAddress);
    server.send(200, "text/html", html);
}

void handleControl() {
    if (server.hasArg("t") && server.hasArg("s")) {
        int rawT = server.arg("t").toInt();
        int rawS = server.arg("s").toInt();
        
        targetSpeedT = constrain(rawT, -motorConfig.pwmEffectiveLimitT, motorConfig.pwmEffectiveLimitT); 
        targetSpeedS = constrain(rawS, -motorConfig.pwmEffectiveLimitS, motorConfig.pwmEffectiveLimitS);
        
        lastControlTime = millis();

        // 構造 JSON 回應 (包含電壓與即時 Ramp 速度)
        String json = "{";
        json += "\"t\":" + String(targetSpeedT) + ",";
        json += "\"s\":" + String(targetSpeedS) + ",";
        json += "\"rt\":" + String(currentSpeedT) + ","; // Real-time Throttle
        json += "\"rs\":" + String(currentSpeedS) + ","; // Real-time Steering
        json += "\"v\":" + String(batteryVoltage, 2) + ",";
        bool isTimeoutT = (millis() - lastControlTime > motorConfig.controlTimeoutT);
        bool isTimeoutS = (millis() - lastControlTime > motorConfig.controlTimeoutS);
        json += "\"to\":" + String(isTimeoutT ? 1 : 0) + ",";
        json += "\"tos\":" + String(isTimeoutS ? 1 : 0);
        json += "}";

        if (pControlCharacteristic) {
            String response = "T:" + String(targetSpeedT) + ",S:" + String(targetSpeedS);    
            pControlCharacteristic->setValue(response.c_str());
            pControlCharacteristic->notify(); 
        }

        server.send(200, "application/json", json); 
    } else {
        server.send(400, "text/plain", "Invalid arguments");
    }
}

// 處理馬達配置參數 (GET/POST)
void handleMotorConfig() {
    if (server.method() == HTTP_GET) {
        // GET: 回傳當前配置 (JSON 格式)
        String json = "{\n";
        json += "  \"timeoutT\": " + String(motorConfig.controlTimeoutT) + ",\n";
        json += "  \"timeoutS\": " + String(motorConfig.controlTimeoutS) + ",\n";
        json += "  \"pwmEffectiveLimitT\": " + String(motorConfig.pwmEffectiveLimitT) + ",\n";
        json += "  \"rampAccelStepT\": " + String(motorConfig.rampAccelStepT) + ",\n";
        json += "  \"pwmStartKickT\": " + String(motorConfig.pwmStartKickT) + ",\n";
        json += "  \"pwmEffectiveLimitS\": " + String(motorConfig.pwmEffectiveLimitS) + ",\n";
        json += "  \"rampAccelStepS\": " + String(motorConfig.rampAccelStepS) + ",\n";
        json += "  \"pwmStartKickS\": " + String(motorConfig.pwmStartKickS) + "\n";
        json += "}";
        server.send(200, "application/json", json);
    } else if (server.method() == HTTP_POST) {
        // POST: 接收並更新配置
        if (server.hasArg("timeoutT")) motorConfig.controlTimeoutT = server.arg("timeoutT").toInt();
        if (server.hasArg("timeoutS")) motorConfig.controlTimeoutS = server.arg("timeoutS").toInt();
        if (server.hasArg("limitT")) motorConfig.pwmEffectiveLimitT = server.arg("limitT").toInt();
        if (server.hasArg("stepT")) motorConfig.rampAccelStepT = server.arg("stepT").toInt();
        if (server.hasArg("kickT")) motorConfig.pwmStartKickT = server.arg("kickT").toInt();
        if (server.hasArg("limitS")) motorConfig.pwmEffectiveLimitS = server.arg("limitS").toInt();
        if (server.hasArg("stepS")) motorConfig.rampAccelStepS = server.arg("stepS").toInt();
        if (server.hasArg("kickS")) motorConfig.pwmStartKickS = server.arg("kickS").toInt();
        if (server.hasArg("autoUpdate")) motorConfig.autoUpdateEnabled = server.arg("autoUpdate").toInt();

        saveMotorConfig(); // 儲存到 NVS
        
        // 通知 BLE 客戶端配置已更新
        if (pMotorConfigCharacteristic) {
            pMotorConfigCharacteristic->setValue((uint8_t*)&motorConfig, sizeof(MotorConfig_t));
            pMotorConfigCharacteristic->notify();
        }

        server.send(200, "text/plain", "Motor config updated and saved.");
    } else {
        server.send(405, "text/plain", "Method Not Allowed");
    }
}

void setupWebServer() {
    Serial.println("--- 啟動 Web Server (STA 模式) ---");
    server.on("/", HTTP_GET, handleRoot);
    server.on("/control", HTTP_GET, handleControl);
    server.on("/config", HTTP_ANY, handleMotorConfig); // 新增配置接口
    server.on("/update_factory", HTTP_GET, handleFactoryUpdate);
    server.on("/update_factory", HTTP_POST, [](){}, handleFactoryUpdateUpload);
    server.on("/update_github", HTTP_GET, handleGitHubUpdate);
    server.on("/toggle_auto_update", HTTP_GET, handleToggleAutoUpdate);
    server.onNotFound([](){
        server.send(404, "text/plain", "Not Found");
    });
    server.begin();
    Serial.println("HTTP 伺服器已啟動於 Port 80。");
}

// --- mDNS/OTA 設定 ---
void setupMdnsOtaSta() {
    Serial.println("--- 設定 mDNS 和 OTA (STA 模式) ---");
    if (MDNS.begin(globalHostname.c_str())) {
        Serial.printf("mDNS (STA 模式) 啟動: %s.local -> %s\n", 
            globalHostname.c_str(), WiFi.localIP().toString().c_str());
    } else {
        Serial.println("mDNS (STA 模式) 啟動失敗。");
    }

    ArduinoOTA.setHostname(globalHostname.c_str());
    ArduinoOTA.setPassword("mysecurepassword"); 
    ArduinoOTA.onStart([]() { Serial.println("OTA 更新開始..."); });
    ArduinoOTA.onEnd([]() { Serial.println("\nOTA 更新完成! 正在重啟..."); });
    ArduinoOTA.onError([](ota_error_t error) { Serial.printf("OTA 錯誤碼 [%u]\n", error); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        Serial.printf("進度: %u%%\r", (progress * 100) / total);
    });
    ArduinoOTA.begin();
    Serial.println("-------------------------------------------------");
}

// --- 讀取 Preferences 並連線到 Wi-Fi ---
void connectToSavedWiFi() {
    preferences.begin("wifi-config", true); 
    String saved_ssid = preferences.getString("ssid", "");
    String saved_pass = preferences.getString("pass", "");
    preferences.end();
    
    if (saved_ssid.length() == 0) {
        Serial.println("無儲存的 Wi-Fi 憑證。裝置保持 BLE 廣告，等待配置...");
        return; 
    }
    
