VibeCoding-tw/esp32c3-launcher/src/main.cpp
    // 4. 啟動廣告
    BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
    pAdvertising->addServiceUUID(CONFIG_SERVICE_UUID); 
    pAdvertising->addServiceUUID(MOTOR_SERVICE_UUID);
    pAdvertising->setScanResponse(true);
    pAdvertising->setMinPreferred(0x06); 
    pAdvertising->start(); 

    Serial.println("✅ BLE Advertising Started (Bluedroid).");
}


// --- Setup ---
void setup() {
    Serial.begin(115200);
    delay(1000);

    // 載入馬達配置 (必須在馬達邏輯和 BLE 啟動前完成)
    loadMotorConfig(); 

    // --- 初始化馬達控制腳位 (DRV8833) ---
    pinMode(NSLEEP_PIN, OUTPUT);
    digitalWrite(NSLEEP_PIN, HIGH); 
    Serial.printf("馬達驅動 (nSLEEP) 已致能於 GPIO%d\n", NSLEEP_PIN);

    // PWM 設定和連接
    ledcSetup(LEDC_CH_A1, PWM_FREQ, PWM_RESOLUTION);
    ledcSetup(LEDC_CH_A2, PWM_FREQ, PWM_RESOLUTION);
    ledcSetup(LEDC_CH_B1, PWM_FREQ, PWM_RESOLUTION);
    ledcSetup(LEDC_CH_B2, PWM_FREQ, PWM_RESOLUTION);

    ledcAttachPin(AIN1_PIN, LEDC_CH_A1);
    ledcAttachPin(AIN2_PIN, LEDC_CH_A2);
    ledcAttachPin(BIN1_PIN, LEDC_CH_B1);
    ledcAttachPin(BIN2_PIN, LEDC_CH_B2);

    setMotorPwm(0, 0); 
    
    // 初始化 ADC
    analogReadResolution(12);
    analogSetAttenuation(ADC_11db); // 0 - 3.1V 範圍
    
    // 0. 產生唯一的 Hostname
    generateHostname();
    
    // 1. 啟動 BLE
    setupBleServer_Bluedroid();

    // 2. 嘗試連線 Wi-Fi
    connectToSavedWiFi();
}

// --- Loop ---
void loop() {    
    // 1. 超時安全停止檢查 (分別針對 T 與 S)
    if (targetSpeedT != 0 || targetSpeedS != 0) {
        unsigned long elapsed = millis() - lastControlTime;
        
        // 檢查加速馬達
        if (targetSpeedT != 0 && elapsed > motorConfig.controlTimeoutT) {
            Serial.printf("🚨 加速超時 (T)! 強制歸零 (%u ms)\n", motorConfig.controlTimeoutT);
            targetSpeedT = 0;
        }
        
        // 檢查轉向馬達
        if (targetSpeedS != 0 && elapsed > motorConfig.controlTimeoutS) {
            Serial.printf("🚨 轉向超時 (S)! 強制歸零 (%u ms)\n", motorConfig.controlTimeoutS);
            targetSpeedS = 0;
        }

        if (targetSpeedT == 0 && targetSpeedS == 0 && pControlCharacteristic) {
            pControlCharacteristic->setValue("TIMEOUT:0,0");
            pControlCharacteristic->notify(); 
        }
    }
    // 2. 處理延遲的廣告重啟請求
    if (should_restart_advertising) {
        Serial.print("Loop: Executing delayed advertising restart... ");
        pServer->startAdvertising(); 
        Serial.println("✅ SUCCESS");
        should_restart_advertising = false;
    }

    // 3. 檢查連線狀態，並啟動後續服務 (只執行一次)
    if (WiFi.status() == WL_CONNECTED && !servicesStarted) {
        Serial.println("✅ Wi-Fi 連線成功，啟動服務...");
        setupMdnsOtaSta();
        setupWebServer();
        servicesStarted = true;
        Serial.println("-------------------------------------------------------");
        Serial.printf("裝置已啟動: %s.local\n", globalHostname.c_str()); 
        Serial.println("-------------------------------------------------------");
        
        // --- 開機自動更新檢查 ---
        // 稍微延遲一下，確保網路完全穩定
        delay(1000); 
        checkAndPerformAutoUpdate();
    }

    // 4. Web Server 和 OTA 僅在服務啟動後才處理
    if (servicesStarted) {
        server.handleClient();
        ArduinoOTA.handle();
    }
    
    // 5. 處理 BLE 接收到的 Wi-Fi 配置並重啟
    handleBleConfigLoop();
    
    // 6. 馬達 Ramping 邏輯
    motorRampTask();

    // 7. 電壓採樣
    updateBatteryVoltage();
    
    // 保持 loop() 有機會切換任務
    delay(1); 
}
